In [171]:
import cx_Oracle
import pandas as pd

In [207]:
dsn = cx_Oracle.makedsn("localhost",1521,"xe")

In [208]:
conn = cx_Oracle.connect("me_admin","KY",dsn)

In [174]:
cursor = conn.cursor()
cursor.execute("select 'uID' from applyuser")
cursor.fetchall()

[('uID',), ('uID',), ('uID',), ('uID',), ('uID',), ('uID',)]

In [189]:
data = pd.read_csv('/Users/apple/Downloads/applyuser.csv')

In [190]:
data

         uID    uname  uage  upoint usex
0     abc123      kim    22     NaN    F
1  didah2016   yoonji    25     NaN    M
2      cathy  gayoung    23     NaN    F
3   kwak1210     kwak    27     NaN    M
4    abc1234     park    24     NaN    F
5      def80     choi    30     NaN    M

In [191]:
qry = "select * from applyuser"
df_applyuser = pd.read_sql(qry,con=db)

In [192]:
df_applyuser

         uID    uname  uage  upoint usex
0     abc123      kim    22       0   F
1  didah2016   yoonji    25       0   M
2      cathy  gayoung    23       0   F
3   kwak1210     kwak    27       0   M
4    abc1234     park    24       0   F
5      def80     choi    30       0   M

In [193]:
ls = []
for i in range(len(data)):
    tmp = str(data.uID[i]), str(data.uname[i]), int(data.uage[i]), str(data.usex[i])
    ls.append(tmp)

In [194]:
print(ls)

[('abc123', 'kim', 22, 'F'), ('didah2016', 'yoonji', 25, 'M'), ('cathy', 'gayoung', 23, 'F'), ('kwak1210', 'kwak', 27, 'M'), ('abc1234', 'park', 24, 'F'), ('def80', 'choi', 30, 'M')]

In [181]:
print(ls[0])

('abc123', 'kim', 22, 'F')

In [182]:
cursor = conn.cursor()
insert_qry = ("INSERT INTO APPLYUSER(\"uID\",\"uname\",\"uage\",\"usex\")" "VALUES(:1,:2,:3,:4)")


for row in ls:
    cursor.execute(insert_qry, row)
    
cursor.close()
conn.commit()
conn.close()

IntegrityError: ORA-00001: unique constraint (ME_ADMIN.APPLYUSER_PK) violated

In [220]:
docdata = pd.read_csv('/Users/apple/Documents/DOCAPPLY.csv')
new_data=docdata.fillna(0)

In [221]:
docls = []
for i in range(5):
    tmp = str(new_data.uID[i]),str(new_data.ucompany[i]), int(new_data.uTOEIC_score[i]),int(new_data.ucertificate_num[i]), str(new_data.uDOC_PASSFAIL[i]), float(new_data.uGPA[i]), str(new_data.uschool[i]), str(new_data.umajor[i]), int(new_data.uintern_period[i])
    docls.append(tmp)
    
print(docls)

[('abc1234', 'Samsung', 950, 3, 'P', 4.1, 'SEOUL', 'Computer', 12), ('didah2016', 'Samsung', 900, 4, 'P', 3.9, 'SEOUL', 'Computer', 8), ('def80', 'LG', 850, 5, 'F', 3.0, 'SEOUL', 'Computer', 4), ('abc123', 'LG', 920, 3, 'P', 3.5, 'SEOUL', 'Computer', 0), ('kwak1210', 'LG', 800, 0, 'F', 0.0, '0', '0', 0)]

In [222]:
conn = cx_Oracle.connect("me_admin","KY",dsn)
cursor = conn.cursor()
insert_qry = ("INSERT INTO DOCAPPLY VALUES(:1,:2,:3,:4,:5,:6,:7,:8,:9)")

for row in docls:
    cursor.execute(insert_qry, row)
    
cursor.close()
conn.commit()
conn.close()